app/controllers/events_controller.rb

	def update
  		@event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]